Revit 2027 API
ExportPatternTable.Add Method
 Inserts a (key,info) pair into Export pattern table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Add(
	ExportPatternKey exportPatternKey,
	ExportPatternInfo exportPatternInfo
)
Public Sub Add (
	exportPatternKey As ExportPatternKey,
	exportPatternInfo As ExportPatternInfo
)
public:
void Add(
	ExportPatternKey^ exportPatternKey,
	ExportPatternInfo^ exportPatternInfo
)
member Add :
        exportPatternKey : ExportPatternKey *
        exportPatternInfo : ExportPatternInfo -> unit
Parameters
exportPatternKey ExportPatternKey
 The export pattern key to be added.
exportPatternInfo ExportPatternInfo
 The export pattern info to be added.
Exceptions
Exception | Condition
ArgumentException |  The key already exists in the table.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportPatternTable Class
Autodesk.Revit.DB Namespace